Revit 2027 API
SpecUtils.IsSpec Method
 Checks whether a ForgeTypeId identifies a spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsSpec(
	ForgeTypeId specTypeId
)
Public Shared Function IsSpec (
	specTypeId As ForgeTypeId
) As Boolean
public:
static bool IsSpec(
	ForgeTypeId^ specTypeId
)
static member IsSpec :
        specTypeId : ForgeTypeId -> bool
Parameters
specTypeId ForgeTypeId
 The identifier to check.
Return Value
Boolean
 True if the ForgeTypeId identifies a spec, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpecUtils Class
Autodesk.Revit.DB Namespace